import java.util.Scanner;

public class Main {


    public static void main(String[] args) {
   //_______________დავალება N1________________________________________________

        // სტრინგების მასივის ინიციალიზაცია
        String[] words = {"მარმალადიი", "ჩემი გჯერა?!", "ანტუნიიიი", "ლეღვი", "კორკოტ", "ლომბარდი", "ნეონი", "კენრიკ ლამარ", "ნათ ლაიქ ას", "კაიაკატა"};


         //მასივზე გადავლა for-each loop-ით და თითოეული სიტყვის დაბეჭდვა

        for (String word : words) {
            System.out.println(word);
        }


        //____________________დავალება N2_________________________________________________

        Scanner scanner = new Scanner(System.in);
        // რიცხვის მასივი 
        int[] numbers = {10, 20, 30, 40, 50, 60, 70, 80, 90, 100};

        //შემომაქვს მომხმარებლისთვის აპლიკაციის გამოყენების პირობა.
        System.out.println("\nახლა კი გადავიდეთ დავალება N2-ზე:");
        System.out.println("გთხოვთ შეიყვანოთ რიცხვი 10 დან 100 მდე ათეულები. (10,20,30 და ა.შ.)");

        //მომხმარებელს შეჰყავს სასურველი რიცხვი. 
        int inputNumber = scanner.nextInt();

        // მეთოდის გამოძახება, რომელიც გავაკეთე Find კლასში.
        Find.findIndex(numbers, inputNumber);

    }
}